---

C#Visual BasicVisual C++

Include Protected MembersInclude Inherited Members

Revit 2024 API
---
TransactionGroup..::..Start Method
TransactionGroup Class See Also Send Feedback
---

# Overload List

|  | Name | Description |
| --- | --- | --- |
|  | Start()()()() | Starts the transaction group |
|  | Start(String) | Starts the transaction group with an assigned name. |

# See Also

TransactionGroup Class

TransactionGroup Members

Autodesk.Revit.DB Namespace